#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e5102e5d2d2131c1ac7fb35ff1be271b" -> "d1c3218b6733a2aa9763a2c4e14ecd6b"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "7c4b49ebe9e5c3df769531d7e687479a" -> "d64ae55747b37aa1d16cc058ba6db1b9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bd35d83cef6116721aedec1af50aaaa7" -> "d2729e55b6f71cbc88eb53bfc7980bc2"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "47b93eaf9ac49534768ccb7569331a86" -> "06f7ae626e641c2df417975655fcccf0"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "401716f362658cc86f46577cdf4f99d2" -> "51f4eadb05eabdea75d6b6a185602029"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8fdbfb0f806ef72108c7a531a256df8f" -> "1a5fd03a5c6960bafcdf7ecd9961d284"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "516d79243354d0e72f6c6811da67d9f8" -> "87f28bc318d08cb8653d5d9ab5488957"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b31281b5521bb25d85fcac0c95914b92" -> "831d873531ab0c4f86f0c13c78b0efe3"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "cc1bc2f34d920326b33acc97aadf091f" -> "6d425cf559ff8342f540569633dcabc9"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "ff603748c2d6c71f7a18f4c029a33f47" -> "ae53cb92f05cdb33112608e0957a6a17"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "33c2622c2f09fb1c1a83a958ef41582b" -> "d58a77cf5c192775995ccf56f20ca884"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8704b87ee98b96d264223303cbdc6458" -> "a0317cb86f702d31bfabcf8e5fbfa817"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c05aed5a3557873633e971ed79dd2fbe" -> "7510af62fbe2efbbd87af5b0a39388e7"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "f13b9f2c869c48b7919217b8cbe8ff0f" -> "b6533b6314ee567c3c6a980334d1f100"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "8d46fdbe3d3677f41aa85b3f2499c790" -> "f10c6c9964112cf9a8827e3f1a9f7650"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "446c8a25757a78de7151a445c85087a3" -> "a89509cfdc277ead831cc744722556cf"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "95ed55165ee0e705aa583572ced54e85" -> "723e1a2a1df7ea8b4903f6b1c0296953"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be created
  + resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6cecd51b07df086ab1df50238a7d7e52"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_all_ranges_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_all_ranges_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "7ba6cb08dadd42f613b4c1c5682c7187" -> "cb6a9cd66938bb9b49029612947ef306"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "3dc167bbe834c3b5ef3f248fcedefe7a" -> "bb55a6a360ce19372ce0cacefb2d849f"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "bd2cfac8e30be6943a716c25cba4a76f" -> "1dd6ed207f141b45dd898d93e9954901"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "461dec0e7fab40daad6e4b7e849ca8f9" -> "a007f70b75791b2f4da3ab71705d88a1"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f840bc1c0243a2a8ee6a0c247ef01d56" -> "c8cf194a92f436cbb7f5b34704b8d37a"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "541cf38eb339a11f361b89dc5297eeaf" -> "49f32c1b6486ccf0cde78eedc009e6cd"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "72b383a9fb7c76f1b0917b0d3e502d6e" -> "dc581a14c0888cc4d09ce0e96e9f8c3b"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "551266ef506784ab14a157df2878c91f" -> "8381f8fb5b17ed3769ed10b5a03abba2"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9002274c19e84daa709d655bd71f994" -> "09afaaeb0fd80fed566107a1f578962a"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "e4c35268c94f27a4b5c1b2802267574f" -> "b652f32a2471e1f8b6cb4f8d97fed72c"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "473e502195dbc8ee8e6e41808f2a380f" -> "d9ba2e6bb4cdf94b14c83f3bb25f36a8"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "543a3d9a58f7df27c7e1fcccef060405" -> "979dfebcca29ff299463b7d82b20263d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "ce6ef02520743aa51b750c7b1b5715d9" -> "fde0aa8da9e96841ecc580fdf6d4e3fe"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "05b1411d17444ec54992d6cc667049cd" -> "39b6e27d6ced3e1fe8b7b88df929f113"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "1a57ebe72827130e59a5e5f25ce0f9db" -> "8ab184e22effd153cc19087890f59ee4"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6a8ddb3f12daf1739cea91dca005128b" -> "26e209ec4a8552ff7caccb5a96ec1b9b"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4764ea5fe5e06796de976dc94bae7f8" -> "028b8c5b4c8d71d37dfcfad2bb99019b"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "08ec8493fa1cfeb105e3574738f3d7ff" -> "b84c6d469866329e9970b497dfc28984"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "f154faab5b009454e797d9eb3982ebb9" -> "ae8f4444f98c059b96477f254cd6ef95"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0e027d47705720d54c82bbc297831eb8" -> "edd3ee7ac35854b4acf2a7382f8b93ac"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "c7dd560f367ece5ace365baf143dcdd2" -> "a7aecf71b62f056c9bb4e75cf2543d64"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "f057c779bb8f7dfb1e17122e68ba6b54" -> "0cfc3cb43c4b2891967e295db4a8b0d7"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "20bf69ab8d839ab4a954dd43dcc48378" -> "94413f151adc5bf23ee13c529c539fc7"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "97a41b847a3a1084c0f8648e50cbf8af" -> "85925f1df9596206f9d395d2ed2045d7"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "e33738e04ef47a78aaa14d575d51bb7d" -> "11cdb82825ad7731d2de240881fc9bfc"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "H+/ZDTtxe1whMZloZOeitkC9AmBkQSbYve32Vbu8Hfk=" -> "Vuxtm8LZFL3jGhkgFQoJfmnBhB25y0R0akGxEIZ/dIU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "04uCD0JmvzGjj508uB6X+md+dTMb+C0fGG/lkOKMG+c=" -> "bMdDSSa47kznd160ZYp13N18uJ69aZ99U6S5swRBxBI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmUGEJKjvTAeHIBQZO+4nj++mc4dpMAFi0vnXsdbqdo=" -> "xwsgkEEf1R0WShlu5KwiTr7UElqluVjH//UkJ5sy5EM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "n6NnpOWdI+uLI+RneayaqpnVonsPvqOuGVk6mEtVth0=" -> "oKksw0FSTWY/9cRuJ33YjC5to2CWUUP8WM0Ez4pD3sg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "5VZuMdNpXQ7YoYYK47Lg0LNHl5505NHAEwh4sbvbwag=" -> "3BT9j1nLrTcqNjKzCh0s/3M4Obclw5nv/Nqwp8j7vlo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWly7tWQihHRjRIXPSis3RJm38Wem5JgfhrkBlFwJlw=" -> "8VtJW7Dh6khM9I6ymMVOga2hSwK1WeJGtYOL8X94/hg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "HPAzrTZOJjEPsiIAsjzQU8iy2i786ZorlZkXLuAcSyQ=" -> "ZTfUx5D7jRkY18WTq9ztAQyemr7TiXDEmRlgyFbF+Mk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "DMeWtHMOC1BjUr3sefDJDWWS57Ap0dLNmrX1FG+s/LY=" -> "s99oEfRl9cNxh4s5UYEq0tDmKpIL+GjsgROmvxv+7rE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "DM0JZyLfsFnfrQgSRMbkuILgTvo3LNX9kit/Gi7ydew=" -> "XCLnuJPDg90ToIk48MHHSyx9BB9XwIo89ovuhHoH4JM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "2+m+/cWQMUIKy+fo+4OB4K1l3ZxUp3dQp5XvksN9GMo=" -> "L09S3YoeUbzJyA+oryQu0ds55LQfVmgeMjNUt6YveiE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVn3zj9jKUHuumGyNVW8BDeuN2ME4IgTHcMX2b9V2/4=" -> "llVULboUho1bFeeEIeOcuEeH68wk8e0dTTZVij+ZQ3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "FbVFf9Vfc46LKIAnmyidkZS1GlYUHUoVV1RsT2cVnU4=" -> "dheK8ckCbYv5f7fWEskiJOdRm4gLaDG8kOdPQqUSqZY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFiltjCE0rvZUvV/taLDGzmFlskOemjhncrYZt22uHw=" -> "eGQqQXmgThoVa1x9895kc48hChdNuk2k3it2vD2fi1Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "1LYjOtKjdkSpFOzqIDIVSK/iXUFWv5KcQClBuKh09mg=" -> "MROWdZrEqf1iZzL0FTsa5tE2dDk0KzwdnXXSOigx3Rk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "PGCZn/GJ+XDG4Ba+YH8jDqAdcq58U58T6n3ckycj5To=" -> "1zPHU9plqaKTHWZwpEq/53xxVUcVofCwVOPuhHEvCVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "4f+A+bLRkHiTzElsAeI34OJxHRFqWtG5joZoocyeo+o=" -> "8TLc5oGyv8hXuOVsbMAMQaWXy6+XNPiwmGgj8iLCAs8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "L5ktIsA1pAoOY9FmKjHpdiuKCyWSLFodRabjBWSFFpY=" -> "EKDXtVnz/MogUaQGgnAH2c1KOdGMaRIrp6AjTVCZXpM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be created
  + resource "aws_lambda_function" "get_all_ranges_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_all_ranges_lambda_function"
      + handler                        = "get_all_ranges_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_all_ranges_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "MWR7rQWrzvhWNoAW9sS5Wcsu3W4QA28NHW3cla8RP0A="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "oK9LG76YFtqihOwxWLDeYHwbR1EkW38NgrJjMGep5Z8=" -> "tb9pFZC4CUruict4VipL2SJ/AUPWH8ngQKO2f2NVzn0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "ak/hdCTLlXcH0S7SO/NvM8WuADNvMha3fGesitP4Xpo=" -> "aPW+sT8IdoiP1CDl7+7Wu/fYJrfsNEueV3b0X2aaN0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcG9y34cDs2rt2HXEP123k0mAkdULR+eeTHbm0XVRP4=" -> "9us/2gjVZDAo7ztX2FCshk+IMkDL4ya2BWkToRU8GSw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "c89KlKJXkzSzCOngHZkphzt9Ud95QgyZ4oAP67zKCb0=" -> "9G6GNRMgsVffpYmx1j/lmZ0I1RNRBEeBfBkBxdfC/Bk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gco9t5wErgPIWRMDUn9z60QVIWBgEYOK60eXeXGUYlk=" -> "2GQbfZwPMzIKz8HnOMxySpOi8sDNhL4Tg7ko64F8hKs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "KnGmKfeOyYaHBb4LBaeoEJSKUXHhPOGzpvSmflDBb78=" -> "OW7+uFU/VaI9E5juDskvZ4XWFDLTnfsZI3qD24X0KhE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "mk3m3zh10FVYhCwjiOlVO3TA2wQbM6wKfOuGnHWeJeI=" -> "FNgyjBcao5JFYEwIkdeZcrmyEvl6Ue4czBscuKUqey0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "2/JrsXk2/UUKz1PLt2GQge/mL1S/frdZVXGo65rz3s4=" -> "Se1LPIZaMH4A6oNU96zlUKIewtT606FmRG+qD3dm5rY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "00YWuo55g+VGYJjJhhfWqRTocuobo4bRDiWmjcUYzOs=" -> "ZXVXVlq475x/B5YhiIe7x83GzHrVxKJp2hZuax4ItRY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "S16P6gOkGURhl7uZt7ntivb3idvbYv/ikAXZdU/AehU=" -> "VdWu2OI6hK/RxN80/NIUBvuWWLW7bYPsfOJSaBPxMO0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "+ha4zL/gBSswYHPgYwRvzGCkwJ8aY+vvb7pjBq0efoo=" -> "itA16QfJn9Xbj/MlKx9VRZ8febiEKNQgBpGAKUqSpYo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Xw5ld5fZ7Gm0/PgI5JrMXXK+M6lX/wt3nXDdpogp1DY=" -> "SbjwEYuBB8Jn/zkzT47QiC+wJ7Ec/Xl3p1wuwSIonLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "lP5LhAFHF7N4maIK5UmYaQZfItEsXuKGyDh15PRY0wk=" -> "M6BxSF6W3kFzrEdD9wsoPBIPEbuP7rFcThiWbrrtz84="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWfwI4v62jcXu9xfFMoEmJYyr3TOTMldu/eY6u/Ting=" -> "zkOGfwYpn8qUkh7hLFg10YVs3hZ+w1rNzN3g39SfZCQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DooeVwoiU35xN2SwSDJwhYpsP7haZEK1v4arJzY/KOk=" -> "+3KXZdGjvybVKWtr6AFLVuTWwutlpZJjZE/AsywwUzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "ER/m/qeQatL5+1SaiNcziiyLzgW7w/9EdfB5n27Xcvw=" -> "ImxDlwrrnOMOlTFoFTbVSsDhy9X0HgkXxdxxq03YHs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewmUcPgBC4DIF2ZBYGfunW0FWiURq9GQdWLcm9MCo2g=" -> "29GBoAi5rsu6pKMyvqDcRFRotrvjHvBCfG3qo4gMUyE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "amsBQTXjqo8zWeAOXSTIgOXUarQnN0/FUbQz8EjIVYs=" -> "P8FFU12m1zTwpIcusGG/Ql4q4dolprzh4n9v3hkUH2A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "2i85bqr31qP5Ri0lzArhBgJa4Jf8ep1stiAvws1EzsE=" -> "wT850rPGWsJv6pejEJWpTt3FY4bZ5rGioQUtqUxDt50="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "njqq9bXYrmKDA1Xccy6APCYJwWpJ4IdYtz4OSPEk7Ac=" -> "Xtj8zFsJK24DvmNhGSVj9mS+Ec3w1q7AnNqMe3D0cVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "9VVs4VrF88Ja1uyt9UZ/yeJOPzamTRe3nSt9HDv2bFs=" -> "E0nB2P7YmMpdvpKR9Db0UqPWUUpM9qZtLbo6bgr2dxI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "HWUxgkDvYeAMhX/0npP8JeHmwQ27hoZ/hmRLKm5aupo=" -> "3hBQzbUB6TRvzzxOlxKWdGdoJX/gQZ5ZtVBxun39j/w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "wxZD1baRonwymXiwMjWb5Wv6hvagldj3TiV3xePJA+Q=" -> "fBjMKmR8ot918CvIeba0jz8cRvjH2muLtbR3jOPCY1E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z2Gn7+c0WD9oEJruyK+iBoEDKWgKKSxw5lDbiacAttE=" -> "6QJrhOO9lkx1bi2i0bzh6z/ycpiTdBjO9PqnkXrSr34="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-21T17:16:55Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "r57vbn" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-21T17:16:54Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_all_ranges_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_all_ranges_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_all_ranges_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_all_ranges_integration will be created
  + resource "aws_api_gateway_integration" "get_all_ranges_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_all_ranges_method will be created
  + resource "aws_api_gateway_method" "get_all_ranges_method" {
      + api_key_required   = false
      + authorization      = "CUSTOM"
      + authorizer_id      = "3y14fs"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.limit"  = false
          + "method.request.querystring.offset" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.ranges will be created
  + resource "aws_api_gateway_resource" "ranges" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "metric_ranges"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-21T17:17:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_all_ranges_lambda_exec_role will be created
  + resource "aws_iam_role" "get_all_ranges_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_all_ranges_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_all_ranges_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_all_ranges_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_all_ranges_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_all_ranges_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_all_ranges_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_all_ranges_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_all_ranges_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_all_ranges_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_all_ranges_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_all_ranges_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_all_ranges_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_all_ranges_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGetAllRanges"
    }

Plan: 12 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*